%%
clear;
clc;
n_1=10;
n_2=10;
n_3=10;
n_4=10;
n_5=10;
n_6=10;
n_7=10;
n_8=10;
global N;%做模拟时的样本量
N=10000;

%%
%所有随机数在这里生成，全部是全局变量，用于近似G等分布函数：这里模拟几个枢轴量的分布
%对应着5个枢轴量，分别为指数分布下自由度2n的卡方分布；威布尔分布下两个（标准极值分布极值和标准差）；对数正态分布下两个（标准正态分布的均值和标准差）。
global randnum_2 randnum_3 Q_1 Q_l1 Q_l2 Q_w1 Q_w2
Q_1=sum((normrnd(0,1,2*n_1,N)).^2);%生成自由度为2n_1的卡方分布,指数分布用到的枢轴量。
randnum_2=log(-log(rand(n_2,N)));%均匀分布
Q_w1=mean(randnum_2);
Q_w2=(n_2-1)*Var(randnum_2)/n_2;%这是威布尔分布需要用到的两个枢轴量
randnum_3=normrnd(0,1,n_3,N);%正态分布
Q_l1=mean(randnum_3);
Q_l2=(n_3-1)*Var(randnum_3)/n_3;%这是对数正态分布需要用到的两个枢轴量

%%
%参数设置,真值
aa=0.2; %置信水平alpha
eta=200;
m=2;
mu=5;
sigma=1;



%%
%关心4-out-of-8系统